//=============================================================================
//Задача 23: Напишите программу, которая принимает на вход число (N) и 
//выдаёт таблицу кубов чисел от 1 до N.
//
//3 -> 1, 8, 27
//5 -> 1, 8, 27, 64, 125
//=============================================================================

//Ввод целого числа 
int N;
while (true)
{
  Console.Write("Введите натуральное число: ");
  if (int.TryParse(Console.ReadLine(), out N)) break;
  Console.WriteLine("Ошибка ввода.");
}
//Введено не натуральное число
if (N < 1) Console.WriteLine("Введено не натуральное число.");
else
{
  //Выводим исходное число и куб единицы
  Console.Write($"{N} -> 1");
  int number = 2;
  //Цикл от 2 до N 
  while (number <= N)
  {
    //Вычисляем куб числа и выводим в консоль
    int cubeNumber = number*number*number;
    Console.Write($", {cubeNumber}");
    number++;
  }
  //Для красоты перевод на новую строку
  Console.WriteLine();
}
