#==============================================================================
# Задача 2: Найдите сумму цифр трехзначного числа.
#
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)
#==============================================================================
#print(sum(map(int, input())))

n = int(input())

a = n // 100 % 10       # разряд сотен
b = n // 10 % 10        # разряд десятков
c = n % 10              # разряд единиц
sum_digits = a + b + c  # искомая сумма

print(f'{n} -> {sum_digits} ({a} + {b} + {c})')
