/* Задание 6. Проход змейкой (дополнительное задание)

Есть двумерный массив целых чисел размером 5 на 5 элементов. Его надо
инициализировать и отобразить на экране. Особенность именно в способе этой
инициализации. Элементы должны быть инициализированы не последовательно,
а змейкой: в конце каждой строки мы должны не переходить к первому элементу
следующей строки, а начать наоборот, с последнего элемента и так далее.
В конечном отображении массива числа должны быть упорядочены по возрастанию,
но змеевидно от строке к строке. Сама же последовательность чисел — это простое
линейное возрастание от 0 до 24, для её учёта можно завести отдельную
переменную. Попытайтесь решить эту задачу используя минимальное количество
временных переменных и без условных переходов if. Если вы найдёте формулу
индексации, будет замечательно! Она может быть весьма витиеватой..

Советы и рекомендации
Результирующий массив должен выглядеть так:

0 1 2 3 4
9 8 7 6 5
10 11 12 13 14
19 18 17 16 15
20 21 22 23 24

Внешний и внутренний циклы идут от 0 до 5, тут ничего нового.
Первый индекс (строка) тоже без сюрпризов: это значение счётчика внешнего цикла:

for (int i = 0; i < 5; ++i) {
for (int j = 0; j < 5; ++j) {
digits[i][...] = number;
number += 1;
}
…
}

Самое сложное тут — это номер столбца. Чтобы сначала двигаться слева направо,
а на следующей строке наоборот, стоит завести переменную-множитель, которая
на чётных строках будет равна 1. На нечётных строках меняет знак:
multiplier *= −1;

Что оценивается
В решении не используются условные конструкции.
*/

#include <iostream>

void printMatrix(const int arr[][5]) {
  for (int i = 0; i < 5; ++i) {
    for (int j = 0; j < 5; ++j) {
      std::cout << arr[i][j] << "\t";
    }
    std::cout << "\n";
  }
}

int main() {
  // Приветствие
  std::cout << "Массивы и Указатели в C++\n";
  std::cout << "Урок 3. Двумерные массивы и алгоритмы над ними\n";
  std::cout << "Практическая работа\n";
  std::cout << "Задание 6. Проход змейкой (дополнительное задание)\n\n";

  // Решение
  int digits[5][5];
  int number = 0;
  int multiplier = 1;
  for (int i = 0; i < 5; ++i) {
    for (int j = 0; j < 5; ++j) {
      digits[i][multiplier * (j - 2) + 2] = number;
      number += 1;
    }
    multiplier *= -1;
  }

  // Вывод
  std::cout << "Результирующий массив:\n";
  printMatrix(digits);

  return 0;
}
