//=============================================================================
//Задача 29: Напишите программу, которая задаёт массив из 8 элементов и 
//выводит их на экран.
//
//1, 2, 5, 7, 19 -> [1, 2, 5, 7, 19]
//6, 1, 33 -> [6, 1, 33]
//=============================================================================

//Основная программа
int[] arr = { 1, 2, 3, 4, 5, 6, 7, 8 };
//Вывод на экран массива
PrintArray(arr);


//Функция вывода массива
static void PrintArray(int[] array)
{
    for (int i = 0; i < array.Length; i++)
    {
        Console.Write($"{array[i]} ");
    }
    Console.WriteLine();
}